import pandas as pd

data = {
    'Возраст': [23, 22, 21, 20, 28, 29, 30, 25, 26, 27],
    'Зарплата': [54000, 55000, 56000, 57000, 58000, 59000, 60000, 55000, 56000, 57000]
}

df = pd.DataFrame(data) # создание датафрейма

# весь список параметров
print(df.describe())
print('______________________________')
# Округлить  после запятой и вывести на экран
print(df.describe().round())
print('______________________________')
print(f'Минимальный возраст: {df["Возраст"].min()}')
print(f'Средний возраст: {df["Возраст"].mean()}')
print(f'Медиана возраста: {df["Возраст"].median()}')
print(f'Максимальный возраст: {df["Возраст"].max()}')
print(f'Стандартное отклонение: {df["Возраст"].std()}')
print('______________________________')
print(f'Средняя зарплата: {df["Зарплата"].mean()}')
print(f'Медиана зарплата: {df["Зарплата"].median()}')
print(f'Стандартное отклонение ЗП: {df["Зарплата"].std()}')
print('______________________________')
print('Программа выполнена!')
